Repository: JJConsulting/JJMasterData
Catalog: src/MasterData.Commons/Resources/MasterDataResources.*.resx
Languages: pt

source: If the insert method is executed successfully, the parent element is opened again at editing mode.
pt: Se o metodo de insert for executado com sucesso, o elemento pai é aberto novamente no modo edição.

source: If you are sure the file is safe you can specify file types separated by comma or
pt: Se você tiver certeza de que o arquivo é seguro voce pode especificar os tipos de arquivo separados por virgula ou

source: If you want to increase the size of this field, you will need to change the setting in the application's web.config in the key
pt: Se você deseja aumentar o tamanho desse campo será necessário alterar configuração no web.config da aplicação na chave

source: If your table's primary key is the id field (autonumeric) and you set the path:
pt: Se a chave primária de sua tabela for o campo id (auto numerico) e você configurar o caminho:

source: Ignored:
pt: Ignorados:

source: Import
pt: Importar

source: Import action not enabled
pt: Ação importar não habilitada

source: Import configured with scope per user, but no key with USERID found.
pt: Importação configurada com escopo por usuário, porém nenhuma chave com valor USERID foi definada.

source: Import Fields
pt: Importar Campos

source: Upload File
pt: Upload de Arquivo

source: Importation started on
pt: Importação iniciada em

source: Important points
pt: Pontos Importantes

source: Importing {0} records...
pt: Importando {0} registros...

source: Index Name
pt: Nome do Indice

source: Apply User Id On
pt: Aplicar Id do Usuário Em

source: Indexes
pt: Índices

source: IndexName
pt: Nome do Índice

source: Indicates whether the gridview header will be visible when there is no data
pt: Indica se o cabeçalho da gridview ficará visível quando não existir dados

source: Inform the Id
pt: Informar o Id

source: Information
pt: Informação

source: Insert Action
pt: Ação de Insert

source: Insert action not enabled
pt: Ação adicionar não habilitada

source: Inserted:
pt: Incluidos:

source: Integer number
pt: Num. inteiro

source: Internal Redirect
pt: Redirecionamento Interno

source: Internal Title
pt: Titulo Interno

source: Internationalization not enabled, check the [JJMasterData.TableResources] parameter
pt: Internacionalização não habilitada, verifique o parâmetro [JJMasterData.TableResources]

source: Internet unavailable
pt: Sem acesso a internet

source: Invalid Access
pt: Acesso Inválido

source: Invalid Action
pt: Ação inválida

source: Invalid character
pt: Caractere inválido

source: Invalid CNPJ
pt: CNPJ inválido

source: Invalid CPF
pt: CPF inválido

source: Invalid data
pt: Dados inválidos

source: Invalid data provider.
pt: Provedor de dados desconhecido.

source: Invalid dictionary name
pt: Nome do dicionário inválido

source: Invalid element
pt: Elemento Inválido

source: Invalid expression for {0} field
pt: Expressão inválida para o campo {0}

source: Invalid fields
pt: Campos inválidos

source: Invalid file path or badly formatted URL
pt: Caminho do arquivo inválido ou URL mal formatada

source: Invalid filter field
pt: Campo filtro inválido

source: Invalid number of fields.
pt: Quantidade de campos inválidos.

source: Invalid Parameter
pt: Parâmetro inválido

source: Invalid parameter or not a list
pt: Parametro inválido ou não é uma lista

source: Invalid parameter or not found
pt: Parâmetro inválido ou não localizado

source: Invalid parameters when opening file upload
pt: Parametros inválidos ao abrir o upload de arquivos

source: Invalid primary key
pt: Chave primária inválida

source: Invalid Protheus Request
pt: Chamada do Protheus inválida

source: Invalid return of @RET variable in procedure
pt: Retorno inválido da variável @RET na procedure

source: Invalid Token
pt: Token inválido

source: Invalid [DefaultValue] field
pt: Campo [DefaultValue] inválido

source: Invalid [EnableExpression] field
pt: Campo [Expressão para Habilitar] inválido

source: Invalid [Name] field! There is already an action registered with that name.
pt: Campo [Nome] inválido! Já existe uma ação cadastrada com esse nome.

source: Invalid [Size] field
pt: Campo [Size] inválido

source: Invalid [TriggerExpression] field
pt: Campo [Expressão de gatilho] inválido

source: Invalid [VisibleExpression] field
pt: Campo [Expressão para Visualizar] inválida

source: Invalid [VisibleExpression] panel
pt: Panel [Expressão para Visualizar] inválida

source: IP Address
pt: Endereço de IP

source: Is Default
pt: É Padrão

source: Is Group
pt: É Grupo

source: is not allowed. Allowed extensions:
pt: Erro: tipo de arquivo inválido - permitido:

source: is not allowed. Allowed Max size:
pt: Erro: excedido tamanho máximo de upload - permitido:

source: IsClustered
pt: Está agrupado

source: Bulk Edit
pt: Editar em Massa

source: IsUnique
pt: É único

source: It is not allowed to enable multiple selection without defining a primary key in the data dictionary
pt: Não é permitido habilitar multipla seleção sem definir uma chave primária no dicionário

source: Item description {i} required
pt: Descrição do Item {0} obrigatório

source: Item id {0} required
pt: Id do Item {0} obrigatório

source: Item list not defined
pt: Lista de itens não definida

source: JavaScript Command
pt: Comando JavaScript

source: JJPipeline Process is already running
pt: O processo JJPipeline já está em execução

source: Json return format
pt: Formato de retorno do Json

source: JsonFormat
pt: Formato Json

source: Key
pt: Chave

source: Landscape
pt: Paisagem

source: Last Importation
pt: Última Importação

source: Last month
pt: Mês passado

source: Last page
pt: Última página

source: Last three months
pt: Três últimos meses

source: Last write time:
pt: Modificado em:

source: LayoutFields
pt: Campos de Layout

source: Legal person
pt: Pessoa Jurídica

source: Line
pt: Linha

source: Lines
pt: linhas

source: List Type
pt: Tipo de lista

source: Primary Key Column
pt: Coluna da Chave Primária

source: Update On Cascade
pt: Atualizar em Cascata

source: Delete On Cascade
pt: Deletar em Cascata

source: Foreign Key Column
pt: Coluna da Chave Estrangeira

source: ListType
pt: Tipo de lista

source: MaintainValuesOnLoad
pt: Manter valores na carga

source: Make a menu separator before this action
pt: Faz um separador de menu antes dessa ação

source: Manage Files
pt: Gerenciar Arquivos

source: Mandatory &lt;b&gt;PKTable &lt;/b&gt; field
pt: Campo <b>PKTable</b> obrigatório

source: Mandatory Date of Birth
pt: Data de Nascimento obrigatória

source: [New Element Name] field is required.
pt: Campo nome do dicionário obrigatório

source: Mark all {0} records
pt: Marcar todos os {0} registros

source: Mark|Unmark all from page
pt: Marcar|Desmarcar todos da página

source: Max. {0} characters
pt: Máx. {0} caracteres

source: MaxFileSize
pt: Tamanho máximo do arquivo

source: Maximum file size
pt: Tamanho máximo do arquivo

source: Maximum limit of {0} characters!
pt: Limite máximo de {0} caracteres!

source: maxRequestLength
pt: comprimento máximo do pedido

source: may result in severe civil and criminal penalties, and will be prosecuted to the maximum extend possible under the law.
pt: pode resultar em severas penalidades civis e criminais e será processado na máxima extensão possível de acordo com a lei.

source: Message
pt: Mensagem

source: Methods
pt: Métodos

source: Mode
pt: Modo

source: More
pt: Mais

source: More Options
pt: Mais Opções

source: Move Down
pt: Mover para baixo

source: Move Up
pt: Mover para cima

source: MultipleFile
pt: Arquivo Múltiplo

source: Name
pt: Nome

source: Name of field already exists
pt: Nome do campo já existe

source: Field {0} already exists.
pt: Campo {0} já existe.

source: Need more help?
pt: Precisa de mais ajuda?

source: New
pt: Adicionar

source: New Action
pt: Nova Ação

source: New Dictionary Name
pt: Nome do novo Dicionário

source: New File
pt: Novo Arquivo

source: New Index
pt: Novo Índice

source: No
pt: Não

source: No - Close the form and return to the list.
pt: Não - Fecha o formulário e volta para lista.

source: No data records found
pt: Nenhum registro de dados encontrado

source: No dictionary found
pt: Nenhum dicionário localizado

source: No dot or comma.
pt: Sem ponto ou virgula

source: No lines selected.
pt: Nenhuma linha selecionada.

source: No primary key defined in dictionary
pt: Nenhuma chave primária definida no dicionário

source: No recently generated files.
pt: Nenhum arquivo gerado recentemente.

source: No record found
pt: Nenhum Registro Encontrado

source: No record selected
pt: Nenhum registro selecionado

source: No records found
pt: Nenhum registro localizado

source: Not order
pt: Não Ordenar

source: Number maximum of records exceeded on {0}, contact the administrator.
pt: Número máximo de registros excedido em {0}, contate o administrador.

source: Number of columns where fields will be rendered by default.
pt: Número de colunas onde os campos serão renderizados por padrão

source: Number of Decimal Places
pt: Número de casas decimais

source: Number of lines in the text box.
pt: Número de linhas na caixa de texto.

source: Object
pt: Objeto

source: objects
pt: objetos

source: of
pt: de

source: Only one process from this element can be run at a time.
pt: Somente um processo desse dicionário poderá ser excutada por vez

source: Only the fields visible on the screen
pt: Somente os visiveis na tela

source: Oops, dictionary not found.
pt: Ops, dicionário não localizado.

source: open action as popup
pt: Abrir ação como popup

source: Options
pt: Opções

source: or
pt: ou

source: Order
pt: Ordem

source: Order Budget
pt: Pedido

source: Orientation
pt: Orientacão

source: Origin
pt: Origem

source: Owner
pt: Pai

source: pages
pt: páginas

source: Panels
pt: Painéis

source: Parameters
pt: Parametros

source: passing as a parameter an action to download the file,
pt: passando como parametro uma ação para realizar o download do arquivo,

source: Password and confirmation password are not the same!
pt: A senha e a senha de confirmação não são a mesma!

source: Password cannot be blank!
pt: A senha não pode estar em branco!

source: Password cannot contain user!
pt: A senha não pode conter o usuário!

source: Password change required
pt: Obrigatório alteração de senha

source: Password must contain at least one number!
pt: A senha deve conter pelo menos um número!

source: Password sent by email if existing
pt: Senha enviada por email se existir

source: Paste Excel rows or drag and drop files of type: {0}
pt: Cole linhas do Excel ou arraste e solte arquivos do tipo: {0}

source: Periods
pt: Períodos

source: Physical person
pt: Pessoa Física

source: PL-SQL Command
pt: Comando PL-SQL

source: PlaceHolder
pt: Texto de Exemplo

source: Please enter a record before proceeding
pt: Insira um registro antes de continuar

source: Popup Size
pt: Tamanho do Popup

source: Portrait
pt: Retrato

source: Post via Ajax
pt: Realizar os posts via Ajax

source: Preview
pt: Pré-Visualizar

source: Primary Key
pt: Chave Primária

source: Foreign Key
pt: Chave Estrangeira

source: Relationship
pt: Relacionamento

source: New Relation
pt: Nova Relação

source: Primary key not defined for dictionary {0}
pt: Chave primária não definida para o dicionário {0}

source: Primary key record
pt: Chave primária do registro

source: Primary key separated by semicolons
pt: Chave primária do registro separado por ponto e virgula

source: Primary key {0} not entered
pt: Chave primária {0} não informada

source: Primary key {0} value not found
pt: Valor da chave primária {0} não localizado

source: Procedure names cannot be identical
pt: O nome das procedures não podem ser identicos

source: Process aborted by the user.
pt: Operação abortada pelo usuário.

source: Process performed on {0}
pt: Processo executado em {0}

source: Property name action is not valid
pt: Propriedade nome da ação é inválida

source: Python Script
pt: Script Python

source: Recently generated files
pt: Arquivos gerados recentemente

source: Record added successfully.
pt: Registro incluído com sucesso.

source: Record already registered.
pt: Registro já cadastrado.

source: Record Key
pt: Chave do Registro

source: Record saved successfully.
pt: Registro salvo com sucesso.

source: Record successfully deleted
pt: Registro excluído com sucesso

source: Record updated successfully
pt: Registro alterado com sucesso

source: records
pt: registros

source: Records per page
pt: Registros por página

source: records.
pt: registros.

source: Recover password
pt: Recuperação de senha

source: redirecting the user to the page where the file was generated,
pt: redirecionando o usuário para página onde o arquivo foi gerado,

source: Redoes the expression whenever a field triggers in Auto Post Back
pt: Refaz a expressão sempre que um campo disparar o AutoPostBack

source: Reference
pt: Referência

source: Refresh
pt: Atualizar

source: Registration data
pt: Dados Cadastrais

source: Relation
pt: Relação

source: Relationships
pt: Relacionamentos

source: Relationship already registered
pt: Relacionamento já cadastrado

source: Remove
pt: Remover

source: Remove All
pt: Remover Todos

source: remove the borders of the fields displaying as text.
pt: remover as bordas dos campos exibindo como texto.

source: Rename File
pt: Renomear Arquivo

source: Reopen Form
pt: Reabrir formulário

source: Reopen Form.
pt: Reabrir o formulário.

source: Replace the field value with a description of the combination when displaying a grid
pt: Substituir o valor do campo com a descrição da combo ao exibir a grid

source: ReplaceTextOnGrid
pt: Substituir texto na grade

source: Required
pt: Obrigatório

source: Required CNPJ
pt: CNPJ obrigatório

source: Required CPF
pt: CPF obrigatório

source: Required field
pt: Campo obrigatório

source: Required field [ElementName]
pt: Campo [ElementName] obrigatório

source: Required field [FolderPath]
pt: Campo [FolderPath] obrigatório

source: Required file name
pt: Nome do arquivo obrigatório

source: Required filter field
pt: Campo filtro obrigatório

source: Required FkColumn field
pt: Campo FkColumn obrigatório

source: Required PkColumn field
pt: Campo PkColumn obrigatório

source: Required ChildElement Field
pt: Campo ChildElement obrigatório

source: Required table name field
pt: Campo nome da tabela obrigatório

source: Required [AllowedTypes] field
pt: Campo [AllowedTypes] obrigatório

source: Required [EnableExpression] field
pt: Campo [Expressão para Habilitar] obrigatório

source: Required [Entity Name] field
pt: Campo [Nome da Entidade] obrigatório

source: Required [EventsTypes] field
pt: Campo [Tipos de Evento] obrigatório

source: Required [JavaScript Command] field
pt: Campo [JavaScript Command] obrigatório

source: Required [Name] field
pt: Campo [Nome] obrigatório

source: Required [PythonScript] field
pt: Campo [Script Python] obrigatório

source: Required [Sql Command] field
pt: Campo [Sql Command] obrigatório

source: Required [Url Redirect] field
pt: Campo [Url Redirect] obrigatório

source: Required [VisibleExpression] field
pt: Campo [Expressão para Visualizar] obrigatória

source: Required [VisibleExpression] panel
pt: Panel [Expressão para Visualizar] obrigatória

source: Required [{0}] field
pt: Campo [{0}] obrigatório

source: Retrieving records...
pt: Recuperando registros...

source: Row:
pt: Linha:

source: Rows
pt: Linhas

source: Run All
pt: Executar Todos

source: Save
pt: Salvar

source: Scope
pt: Escopo

source: Scope of execution of the process.
pt: Escopo de execução do processo.

source: Script Action
pt: Ação do Script

source: Search
pt: Pesquisa

source: Search...
pt: Pesquisar...

source: Select
pt: Selecione

source: Select a field to compose the index
pt: Selecione um campo para compor o indice

source: Select Dictionaries
pt: Selecionar Dicionários

source: Select one or more dictionaries
pt: Selecione um ou mais dicionários

source: Selected
pt: Selecionado

source: Selected Fields
pt: Campos Selecionados

source: Semicolon (;)
pt: Ponto e Virgula (;)

source: separated by semicolons (;), following the layout below:
pt: separadas por ponto e virgula (;), seguindo o layout abaixo:

source: Session expired
pt: Sessão Expirada

source: Set as default option
pt: Definir como opção padrão

source: Set Procedure
pt: Procedimento de Set

source: Set the connection string name in the [log_connectname] key.
pt: Configure o nome da string de conexão na chave [log_connectname].

source: Setting where the file(s) will be stored
pt: Configurando onde será armazenado o arquivo(s)

source: Settings
pt: Configurar

source: Several users can run this process simultaneously, but only see the log and one run of your process.
pt: Vários usuários podem executar esse processo simultaneamente, porém eles visualizarão apenas o log e uma execução do seu processo.

source: Show as Button
pt: Mostrar como Botão

source: Show rows striped
pt: Exibir linhas zebradas

source: Show table border
pt: Exibir bordas na tabela

source: Total Pagination Buttons
pt: Total de Botões na Paginação

source: Show Title
pt: Mostrar Título

source: Show title in page header
pt: Exibir título no cabeçalho da página

source: ShowAsCollapse
pt: Mostrar como recolhimento

source: ShowBorder
pt: Mostrar borda

source: ShowHeaderWhenEmpty
pt: Mostrar cabeçalho quando estiver vazio

source: ShowImageLegend
pt: Mostrar legenda da imagem

source: Showing
pt: Exibindo

source: ShowPagging
pt: Mostrar paginação

source: ShowRowHover
pt: Mostrar linha de passagem

source: ShowRowStriped
pt: Mostrar linha listrada

source: ShowTitle
pt: Mostrar Título

source: ShowToolbar
pt: Mostrar barra de ferramentas

source: ShowViewModeAsStatic
pt: Mostrar modo de visualização como estático

source: Size
pt: Tamanho

source: Size: {0} MB
pt: Tamanho: {0} MB

source: Record Snapshot
pt: Fotografia do Registro

source: Some databases have limitation on object names,
pt: Alguns bancos de dados possuem limitação no nome de objetos,

source: Sort
pt: Ordenar

source: Sort Fields
pt: Ordenar Campos

source: Source dictionary
pt: Dicionário de Origem

source: start
pt: início

source: Stop
pt: Interromper

source: Stop the exportation
pt: Parar a exportação

source: Stop the importation
pt: Parar a importação

source: Stopping Processing...
pt: Parando Processamento...

source: Sub Title
pt: Subtitulo

source: SubTitle
pt: Subtítulo

source: Success!
pt: Sucesso!

source: Success
pt: Sucesso

source: Action saved successfully.
pt: Ação salva com sucesso.

source: Action copied successfully.
pt: Ação copiada com sucesso.

source: Field saved successfully.
pt: Campo salvo com sucesso.

source: Please check the validation errors.
pt: Por favor, verifique os erros de validação.

source: Sync
pt: Sincronizar

source: Sync Mode
pt: Modo do Sincronismo

source: Synchronizing
pt: Sincronizando

source: System Log
pt: Log do Sistema

source: System Version
pt: Versão do Sistema

source: Table
pt: Tabela

source: Table information
pt: Informações sobre a tabela

source: Table not found
pt: Tabela não localizada

source: Table {0} not found
pt: Tabela {0} não localizada

source: Text
pt: Texto

source: The field [NumberOfDecimalPlaces] cannot be defined with the type
pt: Campo [NumberOfDecimalPlaces] não pode ser configurado com o tipo

source: The file extension must remain the same
pt: A extensão do arquivo deve permanecer a mesma

source: the file must contain
pt: o arquivo deve conter

source: the filename is sent to comma-separated database.
pt: o nome do arquivo é enviado para banco de dados separados por virgula.

source: The help text will be displayed like this on the form.
pt: O texto de ajuda será exibido dessa maneira no formulário.

source: The maximum limit of this configuration is determined by the configuration performed on the application server.
pt: O Limite máximo dessa configuração e determinada pela configuração realizada no servidor da aplicação.

source: The maximum request size in kilobytes. The default size is 4096 KB (4 MB).
pt: O tamanho máximo da solicitação em kilobytes. O tamanho padrão é 4096 KB (4 MB).

source: The password must contain at least one uppercase character!
pt: A senha deve conter pelo menos um caracter maiúsculo!

source: The primary key field must be a decimal to contain [NumberOfDecimalPlaces]
pt: Campo chave primária deve ser decimal para utilizar [NumberOfDecimalPlaces]

source: The record cannot be deleted because it is being used as a dependency.
pt: Registro não pode ser excluído, pois esta sendo utilizado como dependência.

source: The [ExportAsLink] field cannot be enabled with [MultipleFile]
pt: Campo [ExportAsLink] não pode estar habilitado com o [MultipleFile]

source: The [Name] field cannot contain accents.
pt: O campo [Nome] não pode conter acentos.

source: The [Name] field cannot contain blank spaces.
pt: Campo [Name] não pode conter espaços em branco

source: The [Name] field contains an invalid character ({c})
pt: O campo [Nome] contém um caractere inválido ({c})

source: There are filters applied for this query.
pt: Existem filtros aplicados para essa consulta.

source: There is already a relationship registered for
pt: Já existe um relacionamento cadastrado para

source: There is no caption to be displayed
pt: Não existe legenda para ser exibida

source: There is no events to display.
pt: Não há eventos para exibir.

source: There is no files to display.
pt: Não existem arquivos para ser exibidos.

source: There is no record to apply
pt: Não existe registro para aplicar

source: There is no record to display.
pt: Não existe registro para ser exibido.

source: There was an error processing your order.
pt: Ocorreu um erro ao processar sua solicitação

source: These are the blocked file types:
pt: Estes são os tipos de arquivo bloqueados:

source: This action can not be removed
pt: Esta ação não pode ser removida

source: This component allows you to add actions, but you must save it to add actions later.
pt: Este componente permite adicionar ações, mas você deve salvá-lo para incluir ações posteriormente.

source: This month
pt: Este mês

source: This task has expired and can no longer run
pt: Essa tarefa expirou e não pode mais ser executada

source: Title
pt: Título

source: Title Pop Up
pt: Título do PopUp

source: To
pt: Até

source: To bulk insert records, select a file of type
pt: Para incluir ou atualizar registros em massa selecione um arquivo do tipo

source: To enable synchronism, the GET endpoints must be enabled.
pt: Para ativar o sincronismo, os endpoints de GET devem ser habilitados.

source: To keep up with the ever-changing malicious software, we frequently update file types without permission.
pt: Para acompanhar a mudança constante de softwares maliciosos, atualizamos frequentemente os tipos de arquivo sem permissão.

source: To:
pt: Para:

source: Today
pt: Hoje

source: Toggle Dropdown
pt: Alternar lista suspensa

source: Toggle navigation
pt: Alternar de navegação

source: ToolBar
pt: Barra de Ferramentas

source: Total buttons on paging
pt: Total de botões na paginação

source: Total Of Records per page
pt: Total de Registros por Página

source: TotalPaggingButton
pt: Botão de paginação total

source: RecordsPerPage
pt: Total por página

source: TotPerPage
pt: TotPorPag

source: Trigger Expression
pt: Expressão de Gatilho

source: Truncated log file, greater than 700 chars
pt: Arquivo de log truncado, maior que 700 chars

source: Type
pt: Tipo

source: Types of historical files
pt: Tipos de arquivos permitidos

source: Unable to identify the format of the list.
pt: Não foi possivel identificar o formato da lista.

source: Unable to retrieve caption
pt: Não foi possível recuperar a legenda
