Repository: JJConsulting/JJMasterData
Catalog: src/MasterData.Commons/Resources/MasterDataResources.*.resx
Languages: pt

source: Unauthorized reproduction or distribution of this program, or any portion of it,
pt: Reprodução ou distribuição não autorizada deste programa, ou qualquer parte dele,

source: Undefined file settings
pt: Configurações do arquivo não definida

source: Undefined font settings
pt: Configurações de origem não definidas

source: Undefined mapping settings
pt: Configurações de mapeamento não definidas

source: Unexpected error
pt: Erro inesperado ao realizar a operação

source: Unfortunately in this scenario you will have to create a field for each file.
pt: Infelizmente nesse cenário você terá que criar um campo para cada arquivo.

source: Unmark all selected records
pt: Desmarcar todos os registros selecionados

source: Unzipping file:
pt: Descompactando arquivo:

source: Update records
pt: Atualizar registros

source: Update some especific fields
pt: Atualize alguns campos específicos

source: Updated:
pt: Atualizados:

source: UpdateOnCascade
pt: Atualizar em Cascata

source: Upload config not defined
pt: Configuração de upload não definida

source: URL accept expression
pt: Url aceita expressão

source: Use '{0}' as separator for {1} decimal places.
pt: Utilizar vírgula como separador de {1} casas decimais

source: Use filters to reduce export volume, if you need to perform this operation frequently, contact your system administrator.
pt: Utilize filtros para reduzir o volume de exportação, se precisar realizar essa operação com frequencia, contate o administrador do sistema.

source: Used in sync?
pt: Utilizado no sincronismo?

source: User
pt: Usuário

source: User Id
pt: Cód. Usuário

source: User Id:
pt: Cód. Usuário:

source: User not found, contact system administrator.
pt: Não foi possível localizar o usuário, contate o administrador do sistema.

source: User [{0}] started the process.
pt: O usuário {0} iniciou o processo

source: Using both Before and After events is not allowed.
pt: Usar eventos de Before e After ao mesmo tempo não é permitido

source: Validate Request
pt: Validar Requisição

source: Value
pt: Valor

source: Value {0} not found
pt: Valor {0} não localizado

source: Verb
pt: Verbo

source: View
pt: Visualizar

source: View Grouped
pt: Exibir Agrupado

source: View in a collapsed panel
pt: Exibir em um painel recolhido

source: View Log
pt: Visualizar Log

source: View Scripts
pt: Exibir Scripts

source: ViewGallery
pt: Visualizar Galeria

source: ViewType
pt: Tipo de Visualização

source: Visible Expression
pt: Expressão para Visualizar

source: Waiting...
pt: Aguarde...

source: Warning!
pt: Atenção!

source: We recommend consulting your current database documentation before proceeding.
pt: Recomendamos consultar a documentação atual do seu banco de dados antes de avançar.

source: We recommend using the following parameters in the query:
pt: Recomendamos utilizar os seguintes parâmetros na query:

source: What can you do
pt: O que você pode fazer

source: When changing the value, it performs a POST request to the server and reloads all form fields.
pt: Ao alterar o valor, realiza uma requisição POST e recarrega todos os campos do formulário.

source: When enabling this property when exporting files to excel or pdf a link will be added
pt: Ao habilitar essa propriedade ao exportar arquivos para excel ou pdf um link será adionado

source: When exporting the field to excel it is not allowed to place more than one link in the same cell,
pt: Ao exportar o campo para excel não é permitido colocar mais de um link na mesma célula,

source: When selecting a record, the insert method is triggered sending the values of the current selection.
pt: Ao selecionar um registro o metodo de insert é disparado enviando os valores da seleção atual.

source: When the AllowedTypes property is * What types are blocked by default?
pt: Quando a propriedade AllowedTypes é * Quais o tipos bloqueados por padrão?

source: When the command is triggered only the selected lines are affected.
pt: Quando o comando é disparado somente as linhas selecionadas são afetadas.

source: When the panel is not in preview mode
pt: Quando o painel estiver no modo de visualização

source: When this property is set, the system will display a list of records for selection.
pt: Quando essa propriedade é configurada o sistema exibirá uma lista de registros para seleção.

source: When we enable the option to upload multiple files,
pt: Quando habilitamos a opção para realizar upload de multiplos arquivos,

source: Where we configure the maximum size in bytes allowed in the upload.
pt: Onde configuramos o tamanho máximmo em bytes permitido no upload.

source: Why when enabling a MultipleFile property I cannot enable ExportAsLink?
pt: Por que ao habilitar uma propriedade de vários arquivos não consigo habilitar Exportar como link?

source: with the maximum size of
pt: com o tamanho máximo de

source: Within this folder will be added several other folders containing the primary key of each record
pt: Dentro dessa pasta serão adicionadas varias outras pastas contendo a chave primária de cada registro

source: Would you like to delete this record?
pt: Gostaria de excluir este registro?

source: Would you like to save the image below?
pt: Gostaria de salvar a imagem abaixo?

source: Writing file...
pt: Gerando arquivo...

source: Yes
pt: Sim

source: Yes - Reopen the form to enter a new record.
pt: Sim - Reabre o formulário para inserir um novo registro.

source: Yesterday
pt: Ontem

source: You are downloading file {0}.
pt: Você esta realizando o download do arquivo {0}.

source: You are trying to export more than 50,000 records, this can cause system overhead and slowdowns.
pt: Você está tentando exportar mais de 50.000 registros, isso pode causar sobrecarga e lentidão no sistema.

source: You can change the table name and other parameters in the application's' Web.Config file.
pt: Você pode alterar o nome da tabela e outras parametrizações no arquivo Web.Config da aplicação.

source: You cannot enable MultiSelect without setting a primary key
pt: Você não pode habilitar MultSeleção sem definir uma chave primária

source: You cannot upload system files
pt: Você não pode realizar upload de arquivos de sistema

source: you will be presented with a different page informing the file name and size that is being downloaded.
pt: será apresentado uma página diferente informando o nome do arquivo e tamanho que esta sendo baixado.

source: You will need to create your data dictionary, to proceed click on the button below.
pt: Será necessário criar seu dicionário de dados, para prosseguir clique no botão abaixo.

source: Your current password is:
pt: Sua senha atual é:

source: Your password will expire soon, change it as soon as possible
pt: Sua senha expirará em breve, altere-a assim que possível

source: Zipping file:
pt: Compactando arquivo:

source: [Apply On Selected] field can only be enabled if the EnableMultiSelect option of the grid is enabled
pt: O campo [Apply On Selected] só pode ser habilitado se a opção EnableMultiSelect da grade estiver habilitada

source: [Command.Sql field] required
pt: [Campo Command.Sql] obrigatório

source: [DataItem] property not set
pt: Propriedade [DataItem] não definidas para pesquisa

source: The [Name] field contains a reserved word used in the api
pt: Campo [Nome] contém uma palavra reservada utilizada na api

source: [order by] clause is not valid
pt: Cláusula [order by] inválida

source: [search_id] retrieves the list record from the found ID that can be used in the query filter condition
pt: [search_id] recupera o registro da lista a partir do ID localizado podendo ser utilizado na condição do filtro da query

source: [{0}] field duplicated in get procedure
pt: Campo [{0}] duplicado na procedure de get

source: [Size] must be between 1 and 38.
pt: [Tamanho] deve ser entre 1 e 38.

source: [Number of Decimal Places] cannot be lesser than 0.
pt: [Número de Casas Decimais] não pode ser menor que zero.

source: [Number of Decimal Places] cannot be greater than [Size].
pt: [Número de Casas Decimais] não pode ser maior que o [Tamanho].

source: Field {0} cannot contain more than {1} characters.
pt: Campo {0} não pode conter mais de {1} caracteres.

source: {0} field contains invalid or not allowed character
pt: Campo {0} contém caracter inválido ou não permitido

source: {0} field has an invalid number
pt: Campo {0} número inválido

source: {0} field has an invalid time
pt: Campo {0} hora inválido

source: {0} field has an invalid value
pt: Campo {0} valor inválido

source: {0} field has an invalid email
pt: Campo {0} possui e-mail inválido

source: {0} field has an invalid phone
pt: Campo {0} possui telefone inválido

source: {0} field is a invalid date
pt: Campo {0} data inválida

source: {0} field is required
pt: Campo {0} obrigatório

source: {0} field not found
pt: Campo {0} não localizado

source: {0} Record(s) deleted successfully
pt: {0} Registro(s) excluído(s) com successo

source: {0} Record(s) with error
pt: {0} Registro(s) com erro

source: {0} records analyzed in {1}
pt: {0} registros analisados em {1}

source: {0} records sync. Time {1}ms
pt: {0} registros enviados. Tempo {1}ms

source: {0} selected records
pt: {0} registros selecionados

source: We recommend checking your database documentation before proceeding.
pt: Nós recomendamos checar a documentação do seu banco de dados antes de continuar.

source: Application Log
pt: Log da Aplicação

source: Page not found
pt: Página não encontrada

source: No stacktrace available.
pt: Stacktrace não disponível.

source: {0} field needs to be greater than {1}
pt: Campo {0} deve ser maior que {1}

source: {0} field needs to be less or equal than {1}
pt: Campo {0} deve ser menor ou igual a {1}

source: There is already a dictionary with the name {0}
pt: Já existe um dicionário com o nome {0}

source: Field with AutoNum (auto increment) must be of data type int, unencrypted and required
pt: Campos marcados como Auto Incremento deve ser do tipo inteiro e obrigatório

source: Data Dictionary
pt: Dicionário de Dados

source: Get Procedure Name
pt: Nome da Proc de Get

source: Light Theme
pt: Tema Claro

source: record(s)
pt: registro(s)

source: Set Procedure Name
pt: Nome da Proc de Set

source: The [Name] field contains a reserved word used in the database.
pt: Campo [Nome] contém uma palavra reservada utilizada no banco de dados.

source: [DataItem] properties not defined for combo
pt: Propriedades [DataItem] não definidas para combo

source: Data source not defined for combo
pt: Origem de dados não definida para combo

source: Error loading data from JJComboBox {0}. Error Details: {1}
pt: Erro carregar os dados da JJComboBox {0}. Detalhes do Erro: {1}

source: (All)
pt: (Todos)

source: (Choose)
pt: (Escolha)

source: No Order
pt: Sem Ordem

source: Warning: This software is protected by the GPL license.
pt: Aviso: Este software é protegido pela licença GPL

source: For more information, please check our
pt: Para mais informações, por favor leia nossa

source: LICENSE
pt: LICENÇA

source: Primary key value {0} contains invalid characters.
pt: Chave primária {0} contém caracter inválido

source: Only fields of type Varchar or Text can have a filter of the type Contains.
pt: Somente campos do tipo Varchar ou Text podem ter um filtro do tipo Contains.

source: Application Settings
pt: Configurações da Aplicação

source: Test Connection
pt: Testar Conexão

source: Connection successfully established.
pt: Conexão estabelecida com sucesso.

source: Inner Exception
pt: Exceção Interna

source: Exception thrown in DataAccess class
pt: Exception aconteceu na classe DataAccess

source: All changes will be saved in the file located at the path:
pt: Todas as alterações serão salvas no arquivo localizado no caminho:

source: Get C# Class
pt: Obter Classe C#

source: Do you want to clear ALL logs?
pt: Você deseja limpar TODOS os logs?

source: Be careful when using this option. You should probably use this option only for WriteOnly fields or store the values in another table.
pt: Tenha cuidado ao usar esta opção. Você provavelmente deve usar esta opção apenas para campos WriteOnly ou armazenar os valores em outra tabela.

source: Multiselect
pt: Multiseleção

source: To select more than one item, enter the desired values separated by a comma.
pt: Para selecionar mais de um item, coloque os desejados valores separados por vírgula.

source: Are you sure you want to delete this relationship?
pt: Você tem certeza que deseja deletar este relacionanmento?

source: Filter for any data inside the structure of the metadata
pt: Filtre por qualquer dado dentro da estrutura dos metadados.

source: Bit fields can only be a checkbox (true or false.)
pt: Campos do tipo Bit só podem ser uma checkbox (true ou false).

source: [FieldDescription] can not be equal a [FieldKey]
pt: [Descrição do Campo] não pode ser igual ao [Campo Chave]

source: [ReplaceTextOnGrid] requires a [FieldDescription]
pt: [Substituir texto na grade] inválido, preencha a [Descrição do Campo]

source: [FieldKey] DataType must be the same of your field.
pt: [Campo Chave] deve ser do mesmo tipo de dados que o seu campo.

source: Element {elementMap.ElementName} not found at your data source.
pt: Elemento filho não encontrado na sua fonte de dados.

source: Start:
pt: Início

source: End:
pt: Fim:

source: Importation Details
pt: Detalhes da Importação

source: The developer has not provided additional information about this plugin.
pt: O desenvolvedor não trouxe nenhuma informação adicional sobre esse plugin.

source: File type is not allowed. Allowed extensions: {0}
pt: Tipo de arquivo não permitido. Extensões permitidas: {0}

source: Click here to upload or drag &amp; drop files
pt: Clique aqui para fazer upload ou arraste arquivos

source: Click here to upload files
pt: Clique aqui para fazer upload de arquivos

source: Click here to upload or paste files
pt: Clique aqui para fazer upload ou cole arquivos

source: Click here, paste or drag &amp; drop files
pt: Clique aqui, cole ou arraste arquivos

source: File is too big. Max file size: {0} mb
pt: Arquivo é muito grande. Tamanho máximo {0} mb

source: Default Value Expression
pt: Expressão do Valor Padrão

source: Enable Synchronism
pt: Habilitar Sincronismo

source: {0} records
pt: {0} registros

source: {0} pages
pt: {0} páginas

source: Page must be between 1 and {0}.
pt: Página deve ser entre 1 e {0}

source: Jump to page...
pt: Pular para página...

source: Customized Field
pt: Campo customizado

source: This field is inside an event handler and its behavior can be modified at runtime.
pt: Este campo está dentro de um manipulador de eventos e seu comportamento pode ser modificado em tempo de execução.

source: 1. Text
pt: 1. Texto

source: 3. Calendar
pt: 3. Calendário

source: 2. Numeric
pt: 2. Numérico

source: MasksGroupName
pt: 6. Máscara

source: 7. File
pt: 7. Arquivo

source: Table Name
pt: Nome da Tabela

source: Filter for anything
pt: Filtre por qualquer coisa

source: EnableSynchronism
pt: Sincronismo Habilitado

source: LastModified
pt: Última Modificação

source: Filter by any data within the data dictionary structure.
pt: Filtre por qualquer dado dentro da estrutura do dicionário de dados.

source: No records found.
pt: Nenhum registro localizado

source: Read Procedure
pt: Procedure de Leitura

source: Write Procedure
pt: Procedure de Escrita

source: FormElement
pt: Formulário do Elemento

source: Import Fields From Table
pt: Importar Campos da Tabela

source: Auto Reload
pt: Recarregar Valores

source: Modal Title
pt: Título do Modal

source: Modal Size
pt: Tamanho do Modal

source: Minimum Value
pt: Valor Mínimo

source: Maximum Value
pt: Valor Máximo

source: Show Border
pt: Mostrar Borda

source: 6. Mask
pt: 6. Máscara

source: 4. Boolean
pt: 4. Booleano

source: Render
pt: Renderizar

source: Enable Sorting
pt: Habilitar Ordenação

source: Enable Multiselect
pt: Habilitar Multiseleção

source: Last Modified
pt: Última Modificação

source: Show Row Hover
pt: Mostrar Hover da Linha

source: Internationalization
pt: Internacionalização

source: If filled, show a confirmation message before executing the action. Support runtime values, for example: {OrderId}
pt: Caso preenchido, mostra uma mensagem de confirmação antes de executar a ação. Suporta valores do runtime, por exemplo: {PedidoId}

source: Supports runtime values. Example: Order {OrderId}
pt: Suporta valores do runtime. Exemplo: Pedido {PedidoId}

source: Supports runtime values. Example: {CustomerName}
pt: Suporta valores do runtime. Exemplo: {ClienteNome}

source: Only relationships are allowed, because you need to map the foreign keys to be used at saving.
pt: Apenas relacionamentos são mostrados aqui, pois você deve mapear suas chaves estrangeiras que serão usadas ao salvar o formulário.

source: Trigger the action when the value of the field is changed.
pt: Gatilha a ação quando o valor do campo é alterado.

source: If true, the entire page will be reloaded after executing the action, else, a AJAX request is made to reload just the current form. If inside a modal, the submit will be executed after the modal is closed.
pt: Se verdadeiro, a página inteira será recarregada após executar a ação, senão, uma requisição AJAX será feita para recarregar apenas o formulário. Se dentro de um modal, o submit será executado após o modal ser fechado.

source: If not in a relationship, Panel is considered the same as Bottom.
pt: Se não estiver em um relacionamento, Panel é considerado o mesmo que Bottom.

source: Show a separator before this action.
pt: Mostrar um separador antes desta ação.

source: Boolean expression to enable the action. See the docs for more information.
pt: Expressão booleana para habilitar a ação. Verifique a documentação para mais informações.

source: Boolean expression to show the action. See the docs for more information.
pt: Expressão booleana para mostrar a ação. Verifique a documentação para mais informações.

source: Expression for a default value. See the docs for more information.
pt: Expressão para um valor padrão. Verifique a documentação para mais informações.

source: Boolean expression to show the field. See the docs for more information.
pt: Expressão booleana para mostrar o campo. Verifique a documentação para mais informações.

source: Boolean expression to enable the field. See the docs for more information.
pt: Expressão booleana para habilitar o campo. Verifique a documentação para mais informações.

source: Expression triggered whenever a field performs a POST to the server. See the documentation for more information.
pt: Expressão ativada sempre que um campo realiza um POST para o servidor. Verifique a documentação para mais informações.

source: Row number at the form, used to break the line in the form flex layout.
pt: Número da linha no formulário, usado para quebrar a linha no layout.

source: Apply the current logged user in this field.
pt: Aplicar o usuário logado neste campo.

source: No relationships found.
pt: Nenhum relacionamento encontrado.

source: Elements
pt: Elementos

source: Filter Mode
pt: Modo do Filtro

source: Never
pt: Nunca

source: Enable Exportation
pt: Habilitar Exportação

source: Line Group
pt: Grupo de Linha

source: Is Modal
pt: É Modal

source: CSS Class
pt: Classe CSS

source: If the redirect is in a modal will render a iframe in the body (not recommended in most cases).
pt: Se o redirect for dentro de um modal, utilizar um iframe no body (não recomendado na maioria dos casos).

source: Developer only information about the element.
pt: Informação apenas para o desenvolvedor sobre o elemento.

source: Enable Write Procedure
pt: Habilitar Procedure de Escrita

source: Enable Read Procedure
pt: Habilitar Procedure de Leitura

source: No indexes found.
pt: Nenhum índice foi encontrado.

source: Show View Mode as Static
pt: Mostrar Modo de Visualização como Estático

source: Use Vertical Layout
pt: Usar Layout Vertical

source: Form Columns
pt: Colunas do Form

source: Use Vertical Layout At Filter
pt: Usar Layout Vertical No Filtro

source: Empty Data Text
pt: Texto para Dados Vazios

source: Text shown when there are no records.
pt: Texto mostrado para quando não existem registros.

source: Enter Key Behavior
pt: Comportamento da Tecla Enter

source: Unique identifier of the element.
pt: Identificador único do elemento.

source: Table where the element data is stored.
pt: Tabela onde os dados do elemento são armazenados.

source: Allow Multiple Files
pt: Permitir múltiplos arquivos

source: Export as Link
pt: Exportar como Link

source: Show Files in Gallery
pt: Mostrar Arquivos em Galeria

source: Max File Size (MB)
pt: Tamanho Máximo do Arquivo (MB)

source: Folder Path
pt: Caminho do Arquivo

source: You can use for example:
pt: Você pode usar por exemplo:

source: Execute Query On Grid
pt: Executar Query na Grid

source: Execute the DataItem in every row, replacing the id at the grid.
pt: Executa o DataItem em todas as linhas, substituindo o id na grid.

source: Replace On Grid
pt: Substituir na Grid

source: Attributes
pt: Atributos

source: Field {0} exceeds maximum size of {0} digits.
pt: Campo {0} excede o tamanho máximo de {1} dígitos.

source: Field {0} exceeds maximum number of {1} decimal places.
pt: Campo {0} excede o número máximo de casas decimais de {1}.

source: Name of the field at the database.
pt: Nome do campo no banco de dados.

source: Name of the field displayed at the form.
pt: Nome do campo exibido no formulário.

source: Change the line color on mouseover.
pt: Mudar a cor da linha no hover do mouse.

source: Show Icon
pt: Mostrar Ícone

source: Enable Multi Select
pt: Habilitar Multiseleção

source: Be careful when using this option. You should probably use this option only for write-only fields or store the values in another table.
pt: Cuidado ao utilizar essa opção! Você provavelmente deve utilizar ela para campos de apenas escrita ou guardar os valores em outra tabela.

source: When the panel is in PageState.View show only the values without the components.
pt: Quando o painel está no modo visualuização, mostra apenas os valores sem os componentes.

source: Validates possibly dangerous values on request on .NET Framework 4.8.
pt: Valida valores potencialmente perigosos na requisição no .NET Framework 4.8

source: Defines the field size. Use -1 to specify MAX keyword.
pt: Tamanho do campo. Utilize -1 para utilizar a keyword MAX.

source: The data type ({0}) is not recommended by modern database providers.
pt: O tipo de dado ({0}) não é recomendado por provedores de banco de dados modernos.

source: The total number of digits stored, including both sides of the decimal point. Ranges from 1 to 38.
pt: O número total de dígitos que podem ser armazenados, incluindo os antes e depois da vírgula. Vai de 1 a 38.

source: Default
pt: Padrão

source: Next page
pt: Próxima página

source: Previous page
pt: Página anterior

source: Configure Grid
pt: Configurar Grid

source: Create or Alter Read Procedure
pt: Criar ou Alterar Procedure de Leitura

source: Create or Alter Write Procedure
pt: Criar ou Alterar Procedure de Escrita

source: Create or Alter All Stored Procedures
pt: Criar ou Alterar Todas as Procedures

source: Execute Alter Table
pt: Executar Alter Table

source: Alter Table
pt: Alterar Tabela

source: Create Table
pt: Criar Tabela

source: Create Table And All Stored Procedures
pt: Criar Tabela e Todas as Procedures

source: Create Table And Write Procedure
pt: Criar Tabela e Procedure de Escrita

source: Create Table And Read Procedure
pt: Criar Tabela e Proceure de Leitura

source: Grid Table
pt: Tabela da Grid

source: Grid Toolbar
pt: Toolbar da Grid

source: Form Toolbar
pt: Toolbar do Formulário
