Repository: JJConsulting/JJMasterData
Catalog: src/MasterData.Commons/Resources/MasterDataResources.*.resx
Languages: pt

source: (Click here for more details)
pt: (clique aqui para mais detalhes)

source: (Select)
pt: (Selecione)

source: ({0} characters remaining)
pt: ({0} caracteres restantes)

source: --Select--
pt: --Selecione--

source: The filename cannot contain comma.
pt: O nome do arquivo não pode conter vírgula.

source: None - The relationship is hidden and not rendered in any component.
pt: Nenhum - O relacionamento está oculto e não é renderizado em nenhum componente.

source: List - The relationship is shown in a list with the actions controlled by the respective Data Dictionary (1xn).
pt: Lista - O relacionamento é exibido em uma lista com ações controladas pelo respectivo Dicionário de Dados (1xn).

source: View - The relationship is shown in a read-only form (1x1).
pt: Visualização - O relacionamento é exibido em um formulário somente leitura (1x1).

source: Insert - The relationship is shown in an insert form (1x1).
pt: Inserção - O relacionamento é exibido em um formulário de inserção (1x1).

source: Update - The relationship is shown in an update form (1x1).
pt: Atualização - O relacionamento é exibido em um formulário de atualização (1x1).

source: 1 (one column)
pt: 1 (uma coluna)

source: 1) To use the upload, the dictionary must have a primary key
pt: 1) Para utilizar o upload o dicionário deve ter chave primária

source: You can also render an image alongside the result by returning a column called ImageUrl.
pt: Você também pode renderizar uma imagem ao lado do resultado retornando uma coluna chamada ImageUrl.

source: 12 (twelve columns)
pt: 12 (doze colunas)

source: 2 (two columns)
pt: 2 (duas colunas)

source: 2) The primary key cannot contain characters
pt: 2) A chave primária não pode conter caracters

source: Form Fields
pt: Campos do Formulário

source: 3 (three columns)
pt: 3 (três colunas)

source: 3) The {app.path} is the path to the root of the site where the application is running and this variable will be replaced at runtime
pt: 3) O {app.path} é o caminho até a raiz do site onde a aplicação esta sendo execuda e essa variável será substituida em tempo de execução

source: 4 (four columns)
pt: 4 (quatro colunas)

source: 4) The path configured in FolderPath must always end with a slash
pt: 4) O caminho configurado em FolderPath sempre deve terminar com barra

source: 5) Be careful not to configure a path that already exists in another dictionary
pt: 5) Cuidado para não configurar um caminho já existente em outro dicionário

source: No elements found.
pt: Nenhum elemento encontrado.

source: {0} months ago
pt: {0} meses atrás

source: Grid Template
pt: Template da Grid

source: No fields found.
pt: Nenhum campo encontrado.

source: 6 (six columns)
pt: 6 (seis colunas)

source: A file with the name {0} already exists
pt: Já existe um arquivo com o nome {0}

source: Url Redirect
pt: Redirecionamento Url

source: One selected record
pt: 1 registro selecionado

source: {0} at {1}
pt: {0} no {1}

source: Redirects to this URL after the command is executed successfully.
pt: Redireciona para esta URL após o comando ser executado com sucesso.

source: Cannot add a recursive relationship.
pt: Não é possível adicionar um relacionamento recursivo.

source: About
pt: Sobre

source: Access denied to change user filter on {0}
pt: Acesso negado para alterar o filtro do usuário em {0}

source: Action
pt: Ação

source: Error rendering template.
pt: Erro renderizando template.

source: Element with custom events
pt: Elemento com eventos customizados

source: This element has external customizations using programming and its behavior is changed at runtime.
pt: Este elemento possui customizações externas utilizando programação e seu comportamento é alterado em tempo de execução.

source: The following fields are used:
pt: Os seguintes campos são utilizados:

source: Redirect Url
pt: Url de Redirecionamento

source: This field support runtime values between {}. Use {AppPath} for the base path of the application.
pt: Este campo oferece suporte a valores do runtime entre {}. Use {AppPath} para o caminho da raiz da aplicação.

source: Is Modal?
pt: É Modal?

source: Icon components can only be of type Int
pt: Os componentes Ícone só podem ser do tipo Int

source: Is Iframe?
pt: É Iframe?

source: Action execution confirmation text
pt: Texto de confirmação antes de executar a ação

source: Action {0} not found
pt: Ação {0} não localizada

source: Actions
pt: Ações

source: Add
pt: Adicionar

source: Add Dictionary
pt: Adicionar Dicionário

source: Add new record
pt: Adicionar novo registro

source: Add Order Budget
pt: Colocar Pedido

source: Add Reference
pt: Adicionar Referência

source: Add Relation
pt: Adicionar Relação

source: Added
pt: Adicionado

source: Added:
pt: Incluidos:

source: Advance
pt: Avançar

source: Advanced
pt: Avançado

source: After creating your data dictionary, just insert your tables and their respective fields!
pt: Após criar seu dicionário de dados, basta inserir suas tabelas e seus respectivos campos!

source: After finishing the process
pt: Após finalizar o processo

source: Alert
pt: Alerta

source: All
pt: Todos

source: Allow dragging files
pt: Permitir arrastar arquivos

source: AllowedTypes
pt: Tipos Permitidos

source: Allows you to export the field
pt: Permite que você exporte o campo

source: Allows you to select multiple lines in the grid.
pt: Permite selecionar multiplas linhas na grid.

source: Allows you to upload multiple files
pt: Permite upload de multiplos arquivos

source: and all users will be able to view the latest log and execution of an ongoing process.
pt: e todos os usuários poderão visualizar o registro e a execução mais recentes de um processo em andamento.

source: and inside, the uploads performed by users are stored.
pt: e lá dentro é armazenado os uploads realizados pelos usuários.

source: Applied Filters
pt: Filtros Aplicados

source: Applied Filter
pt: Filtro Aplicado

source: Apply only on selected lines
pt: Aplicar somenter as linhas selecionadas

source: ApplyUserIdOn
pt: Aplicar ID de usuário em

source: Are you sure you want to DELETE all selected records?
pt: Tem certeza que deseja EXCLUIR todos registros selecionados?

source: Are you sure you want to delete this event ?
pt: Você tem certeza que deseja deletar este evento ?

source: Are you sure you want to delete [{0}] action?
pt: Você tem certeza que gostaria de excluir a ação [{0}]?

source: Are you sure you want to execute this action?
pt: Tem certeza de que deseja executar esta ação?

source: Ascendant
pt: Ascendente

source: Ascending order
pt: Ordem Crescente

source: Attention!
pt: Atenção!

source: Automatic numeric (auto increment)
pt: Numero sequencial (incremento automático)

source: AutoPostBack
pt: Retorno automático

source: Available Fields
pt: Campos Disponíveis

source: Aways apply UserId (from login) as filter and default value on set.
pt: Sempre aplique UserId (do login) como filtro e valor padrão no conjunto.

source: Brazil Phone Number
pt: Número de Telefone Brasileiro

source: Back
pt: Voltar

source: Background task is already running.
pt: Tarefa em background já está sendo executada.

source: Before starting the process
pt: Antes de iniciar o processo

source: Behavior of the Enter key on the form
pt: Comportamento da tecla enter no formulário

source: Birth date
pt: Data de Nascimento

source: Blocked user
pt: Usuário Bloqueado

source: Browser
pt: Navegador

source: Browser info
pt: Informações do navegador

source: By default every post made on the site is limited to 4mb
pt: Por padrão todo post realizado no site é limitado 4mb

source: Cancel
pt: Cancelar

source: Change History
pt: Histórico de Alterações

source: Character {0} not allowed
pt: Caracter {0} não permitido

source: Character {0} not allowed1
pt: Caracter {0} não permitido

source: Child element name
pt: Nome do elemento filho

source: ChildElement
pt: Elemento filho

source: Class
pt: Classe

source: Class name (CSS) to be assigned to object group rendering.
pt: Nome da classe (CSS) a ser acrescentado na renderização do grupo do objeto

source: Clear
pt: Limpar

source: Clear Filter
pt: Limpar Filtro

source: Clear Log
pt: Limpar Log

source: click here.
pt: clique aqui.

source: Click on the Help button for more information regarding the file layout.
pt: Clique no botão de Ajuda para mais informações referentes ao layout do arquivo.

source: Close
pt: Fechar

source: Color
pt: Cor

source: Column
pt: Coluna

source: Column {0} has no filter or is not a primary key.
pt: Coluna {0} não possui filtro ou não é chave primária.

source: Column {0} not found in {1}.
pt: Coluna {0} não localizada em {1}.

source: Columns
pt: Colunas

source: Comma (,)
pt: Virgula (,)

source: Command
pt: Comando

source: Sql Command
pt: Comando Sql

source: Read more about HTML templates
pt: Leia mais sobre templates HTML

source: Component
pt: Componente

source: Component Type
pt: Tipo do componente

source: compress the file before uploading.
pt: compactar o arquivo antes de realizar o upload.

source: Configuration for logging to the database is not enabled
pt: Configuração para log no banco de dados não está habilitada

source: Configure Export
pt: Configurar Exportação

source: Configure View
pt: Configurar Visualização

source: Confirmation Message
pt: Mensagem de confirmação

source: Connection provider not found in configuration file.
pt: Provider de conexão não localizado no arquivo de configuração.

source: Connection string not found in configuration file.
pt: String de conexão não localizado no arquivo de configuração.

source: Content
pt: Conteúdo

source: Copy
pt: Copiar

source: Copy All
pt: Copiar todos

source: Copy All Scripts
pt: Copiar todos scripts

source: Copy to Clipboard
pt: Copiar para Área de transferência

source: Culture Code
pt: Código da Cultura

source: CurrentPage
pt: PaginaAtual

source: Custom name for reading procedure
pt: Nome personalizado para procedimento de leitura

source: Custom name for recording procedure
pt: Nome personalizado para procedure de gravação

source: Data Dictionaries
pt: Lista de Dicionários

source: Data Type
pt: Tipo de Dados

source: Database Scripts
pt: Scripts de Banco

source: DataBehavior
pt: Comportamento dos Dados

source: DataFile
pt: Arquivo de Dados

source: DataTable schema is null
pt: DataTable schema é nulo

source: Date
pt: Data

source: Date and time
pt: Data e Hora

source: Date:
pt: Data:

source: Decimal number
pt: Num. decimal

source: DecimalPlaces
pt: Casas decimais

source: Default connection name is [ConnectionString]
pt: Nome da conexão padrão é [ConnectionString]

source: DefaultValue
pt: Valor Padrão

source: Delete
pt: Excluir

source: Delete a record
pt: Excluir um registro

source: Delete File
pt: Excluir Arquivo

source: Delete Selected
pt: Excluir Selecionados

source: Deleted
pt: Deletado

source: Deleted:
pt: Excluidos:

source: DeleteOnCascade
pt: Excluir em Cascata

source: Delimiter
pt: Delimitador

source: Descendant
pt: Descendente

source: Descending order
pt: Ordem Decrescente

source: Description
pt: Descrição

source: Description on the form
pt: Descrição no formulário

source: Detail Message
pt: Detalhes da Mensagem

source: Detailed Filters
pt: Filtros Detalhados

source: Details
pt: Detalhes

source: Details:
pt: Detalhes:

source: DicSyncParam invalid
pt: DicSyncParam inválido

source: Dictionary imported successfully!
pt: Dicionário importado com sucesso!

source: Dictionary invalid
pt: Dicionário Inválido

source: Dictionary Name
pt: Nome do Dicionário

source: Dictionary name cannot be empty
pt: Nome do dicionário nao pode ser vazio

source: Dictionary name used to display the preselection of a record.
pt: Nome do dicionário utilizado para exibir a pré seleção de um registro.

source: Dictionary {0} not found
pt: Dicionário {0} não localizado

source: Dictionary {0} not found or not configured for sync
pt: Dicionário {0} não localizado ou não configurado para sincronismo

source: Display images with text in the combo
pt: Exibir imagens com o texto na combo

source: Display name in grid header
pt: Exibir nome no cabeçalho da grid

source: Display open dashboard by default
pt: Exibir o collapse painel aberto por padrão

source: Display text (All) as first option
pt: Exibir texto (Todos) como primeira opção

source: display zebra columns
pt: Exibir colunas zebradas

source: Displays paging controls
pt: Exibe os controles de paginação

source: Divider Line
pt: Linha Divisória

source: do not include caption or description in the first line
pt: não incluir legenda ou descrição na primeira linha

source: Documents
pt: Documentos

source: Done
pt: Arquivo Carregado

source: Drag &amp; Drop Files
pt: Arraste e Solte Arquivos

source: Drag and drop to change order.
pt: Clique e arraste para alterar a ordem.

source: DragDrop
pt: Arraste e Solte

source: Drag and drop to move
pt: Arrastando e soltando para mover

source: Duplicate
pt: Duplicar

source: duplicate dictionary
pt: Duplicar dicionário

source: Edit
pt: Alterar

source: Edited
pt: Editado

source: Element
pt: Elemento

source: Element is a Form, to serialize form use SetFormElement method
pt: Element é um Form, para serializar formulário utilize o método SetFormElement

source: Element Map
pt: Mapa do Elemento

source: Element Name To Select
pt: Nome do elemento para selecionar

source: ElementField can not be null
pt: ElementField não pode ser nulo

source: Element Name
pt: Nome do Elemento

source: Empty line ignored
pt: Linha vazia ignorada

source: EmptyDataText
pt: Texto de dados vazio

source: Enable / Disable dictionary actions
pt: Habilita/Desabilita ações do dicionário

source: Enable Column Sorting
pt: Habilita Ordenação das colunas

source: Enable Expression
pt: Expressão para Habilitar

source: Enable Localization
pt: Habilitar Traduções

source: Enable MultSelect
pt: Habilitar seleção múltipla

source: Enable or disable Http operations
pt: Ativar ou desativar operações Http

source: Enable quick screen search
pt: Habilitar pesquisa rápida na tela

source: EnableAjax
pt: Habilitar Ajax

source: EnableElementActions
pt: Habilitar Ações

source: EnableSorting
pt: Habilitar classificação

source: end
pt: término

source: Enter a table or view name
pt: Digite um nome da tabela ou exibição

source: Enter the data below and click Next to add the record.
pt: Informe os dados abaixo e clique em Avançar para incluir o registro.

source: Enter the new name for the file:
pt: Digite o novo nome para o arquivo:

source: EnterKey
pt: Tecla Enter

source: Entity
pt: Entidade

source: Entity List
pt: Lista de entidades

source: Entity Name
pt: Nome da entidade

source: Entity {0} not found
pt: Entidade {0} não localizada

source: Error
pt: Erro

source: Error executing expression of field {0}.
pt: Erro ao realizar a expressão do campo {0}.

source: Error executing expression {0} for {1} field.
pt: Erro ao executar a expressão {0} para o campo {1}.

source: Error importing file!
pt: Erro ao importar o arquivo!

source: Error Message '
pt: Mensagem de Erro

source: Error on write log to database.
pt: Erro ao tentar gravar log no banco de dados.

source: Error raised in DataAccess
pt: Erro disparado na classe DataAccess

source: Error rendering upload! Primary key not defined in {0}
pt: Erro ao renderizar upload! Chave primária não definida em {0}

source: Error rendering upload! Primary key value {0} contains invalid characters.
pt: Erro ao renderizar upload! Valor da chave primária {0} contém caracteres inválidos.

source: Error rendering upload! Primary key value {0} not found at {1}
pt: Erro ao renderizar upload! Valor da chave primária {0} não localizada em {1}

source: Error retrieving expression in Protheus integration.
pt: Erro ao recuperar expressão na integração com o Protheus.

source: Error retrieving expression or trigger.
pt: Erro ao recuperar expressão.

source: Error searching for {0}.
pt: Erro ao pesquisar {0}.

source: Error starting connection provider {0}. Error message: {1}
pt: Erro ao iniciar o provider da conexão {0}. Mensagem de erro: {1}

source: Error synchronizing object: {0}, page: {1}. Details: {2}
pt: Erro ao sincronizar objeto: {0}, pagina: {1}. {2}

source: Errors:
pt: Erros:

source: Event Types
pt: Tipos de Evento

source: Events
pt: Eventos

source: Execute Stored Procedures
pt: Executar Procedures

source: Executed Query
pt: Query Executada

source: Exit
pt: Sair

source: Expanded By Default
pt: Expandido por padrão

source: ExpandedByDefault
pt: Expandido por padrão

source: Expected {0} Received {1}.
pt: Esperado {0} Recebido {1}.

source: Export
pt: Exportar

source: Export file name with download link
pt: Exportar o nome do arquivo com link para download

source: Export first line as title
pt: Exportar primeira linha como título

source: Export not enabled
pt: Exportação não habilitada

source: Export Selected
pt: Exportar Selecionados

source: Export to
pt: Exportar para

source: ExportAsLink
pt: Exportar como link

source: Exportation started on
pt: Exportação iniciada em

source: Exporting {0} records...
pt: Exportando {0} registros...

source: Expression
pt: Expressão

source: Expression for a default value
pt: Expressão para um valor padrão

source: Expression not started with
pt: Expressão não inciada com

source: Expression that returns a Boolean at runtime
pt: Expressão que retorna um booleano em tempo de execução

source: Field
pt: Campo

source: Field behavior in relation to the database.
pt: Comportamento do campo em relação ao banco de dados

source: Field Description
pt: Descrição do Campo

source: Field Key
pt: Campo Chave

source: Field Lookup
pt: Pesquisa de Campo

source: Field Maintenance
pt: Manutenção de Campos

source: Field [{0}] already exists in Element.Fields
pt: Campo [{0}] já existe em Element.Fields

source: Field [{0}] invalid, as it is not PK or not configured as a filter
pt: Campo [{0}] inválido, pois não é PK ou não esta configurado como filtro

source: Field [{0}] is empty.
pt: O Campo [{0}] esta vazio.

source: Field [{0}] not found
pt: Campo [{0}] não encontrado

source: Field [{0}] not returned when inserting record
pt: Campo [{0}] não retornado ao inserir o registro

source: FieldName
pt: Nome do Campo

source: Fields
pt: Campos

source: Fields of type FILE cannot be virtual
pt: Campos do tipo FILE não podem ser virtual

source: File generated successfully!
pt: Arquivo gerado com sucesso!

source: File has been already used.
pt: Arquivo já está sendo usado.

source: File header ignored.
pt: Cabeçalho do arquivo ignorado.

source: File imported successfully!
pt: Arquivo importado com sucesso!

source: File imported with errors!
pt: Arquivo importado com erros!

source: File is already being used by another process. Try downloading it from \&quot;Recently generated files\&quot;.
pt: Arquivo já está sendo usado por outro processo. Tente realizar o download na aba de "Arquivos gerados recentemente".

source: File Name
pt: Nome do Arquivo

source: Download File Name
pt: Nome do Arquivo Para Download

source: File name cannot contain [{0}] characters
pt: Nome do arquivo não pode conter caracteres [{0}]

source: File Name:
pt: Nome Arquivo:

source: File not found at {0}
pt: Arquivo não localizado em {0}

source: File size:
pt: Tamanho do Arquivo:

source: File Type:
pt: Tipo de Arquivo:

source: File types separated with comma ex: txt,csv,xlsx. In * mode system files are blocked
pt: Tipos de arquivo separados por vírgulas, por exemplo: txt, csv, xlsx. No modo *, os arquivos do sistema são bloqueados

source: file types that cannot be included as attachments by default
pt: tipos de arquivo que não podem ser incluídos como anexos por padrão

source: File Upload
pt: Upload de Arquivos

source: File {0} ignored.
pt: Arquivo {0} ignorado.

source: File {0} is being used by another process.
pt: Arquivo {0} está sendo usado por outro processo.

source: File {0} not found!
pt: Arquivo {0} não localizado!

source: Files
pt: Arquivos

source: Filter
pt: Filtrar

source: Filter Action
pt: Ação de Filtro

source: Filter by any field visible in the list
pt: Filtre por qualquer campo visível na lista

source: Filter Expression
pt: Expressão de Filtro

source: Filter Type
pt: Tipo do Filtro

source: Filters
pt: Filtros

source: Filters performed in the previous screen will be considered in the export
pt: Os filtros realizados na tela anterior serão considerados na exportação

source: First page
pt: Primeira página

source: Fix the grid header when scrolling
pt: Congelar o cabeçalho da grid ao realizar Scroll

source: Folder path, ex:
pt: Caminho da pasta, exemplo:

source: FolderPath
pt: Caminho da Pasta

source: FolerPath not defined in upload config to field {0}
pt: Caminho não definido para upload do campo {0}

source: for example Oracle with version less than 12c is limited to 30 characters.
pt: por exemplo o Oracle com versão inferior a 12c é limitado a 30 caracteres.

source: For example:
pt: Por exemplo:

source: For more information, check the log details below
pt: Para mais informações, verifique os detalhes do log abaixo

source: For security reasons we don't allow you to attach some file types by default.
pt: Por questões de segurança por padrão não permitimos que você anexe alguns tipos de arquivo.

source: for this reason it is not allowed to export multiple linked files.
pt: por esse motivo não é permitido exportar multiplos arquivos com link.

source: Form
pt: Formulário

source: Form Sub-Title
pt: Sub-Titulo do Formulário

source: Form Title
pt: Título do Formulário

source: Format (dd/MM/yyyy HH:mm:ss) example:
pt: Formato (dd/MM/yyyy HH:mm:ss) ex.:

source: Format (dd/MM/yyyy) example:
pt: Formato (dd/MM/yyyy) ex.:

source: FormCols
pt: Colunas do Formulário

source: FormElementField can not be null
pt: FormElementField não pode ser nulo

source: JJView
pt: Visualização do formulário

source: MultiValues filters must be a VARCHAR type.
pt: Filtros MultiValues devem ser do tipo VARCHAR.

source: from
pt: de

source: From:
pt: De:

source: General
pt: Geral

source: Get a record detail
pt: Obtenha um detalhe de registro

source: Get all records
pt: Obtenha todos os registros

source: Get Procedure
pt: Procedimento de Get

source: Get Script
pt: Obter Script

source: Good Afternoon
pt: Boa tarde

source: Good Morning
pt: Bom dia

source: Good Night
pt: Boa noite

source: Grid
pt: Grade

source: GridView
pt: Visualização da grid

source: Group Line
pt: Agrupador

source: Header Fixed At Scroll
pt: Fixar Cabeçalho no Scroll

source: Help
pt: Ajuda

source: Hide Log
pt: Ocultar Log

source: Highlight line on mouseover
pt: Destacar linha ao passar o mouse

source: Horizontal label layout on left side of field, vertical label layout above field
pt: Layout Horizontal label ao lado esquerdo do campo, Layout Vertical label acima do campo

source: How do I further increase the file size in the MaxFileSize property?
pt: Como eu faço para aumentar ainda mais o tamanho do arquivo na propriedade tamanho máximo do arquivo ?

source: How to configure a property folder path?
pt: Como configurar a propriedade FolderPath?

source: Icon
pt: Ícone

source: Identity
pt: Auto Incremento

source: If the download does not start automatically, click on the icon below.
pt: Se o download não iniciar automaticamente, clique no icone abaixo.

source: If the download not start automatically
pt: Caso o download não comece automaticamente

source: If the form has a composite primary key, they will be separated by an underscore following a registration order.
pt: Se o form possuir chavé primária composta elas serão separadas por underline seguindo a ordem de cadastro.
