Repository: JJConsulting/JJMasterData
Catalog: src/MasterData.Commons/Resources/MasterDataResources.*.resx
Languages: pt

source: In any option except Id, every row will be evaluated at runtime.
pt: Em qualquer opção exceto Id, toda linha vai ser executada no runtime.

source: Grid Behavior
pt: Comportamento na Grid

source: Icon with Description
pt: Ícone com Descrição

source: Calendar
pt: Calendário

source: Clock
pt: Relógio

source: Behavior
pt: Comportamento

source: Warning: This software is protected by the GNU license.
pt: Aviso: Este software é protegido pela licença GNU.

source: C# Class
pt: Classe C#

source: Compact mode
pt: Modo compacto

source: Save your form to download this file.
pt: Salve seu formulário para baixar esse arquivo

source: Expressions
pt: Expressões

source: Allow pasting files
pt: Permitir colar arquivos

source: Read more about expressions
pt: Leia mais sobre expressões

source: in this link.
pt: neste link.

source: Search Icon
pt: Pesquisar Ícone

source: Alignment At Grid
pt: Alinhamento na Grid

source: Left
pt: Esquerda

source: Center
pt: Centro

source: Right
pt: Direita

source: This field uses a reserved keyword of the database in its name.
pt: Este campo usa uma palavra reservada do banco de dados no seu nome.

source: Warning
pt: Aviso

source: Show Icon At Collapse
pt: Mostrar Ícone no Collapse

source: Show as Switch
pt: Mostrar como Switch

source: Allow multiple dates
pt: Permitir múltiplas datas

source: Autocomplete
pt: Autocompletar

source: When opening the picker, fill the input with today's date.
pt: Quando abrir o calendário, o input é preenchido com a data de hoje.

source: Title Size
pt: Tamanho do Título

source: No icons found.
pt: Nenhum ícone encontrado.

source: Save User Preferences
pt: Salvar Preferências Do Usuário

source: Show Toolbar
pt: Mostrar Toolbar

source: Show Header When Empty
pt: Mostrar Cabeçalho Sem Dados

source: Filters, sorting and grid settings are saved.
pt: Filtros, ordenação e configurações da grid são salvos.

source: View Type
pt: Modo de Visualização

source: Edit Mode Open By Default
pt: Modo Edição Aberto Por Padrão

source: Show as Modal
pt: Mostrar como Modal

source: When set to true, you can insert new records after saving instead of going back to the grid.
pt: Quando setado como true, você pode inserir novos registros após salvar em vez de voltar para a grid.

source: Button At Grid
pt: Botão na Grid

source: Above Grid
pt: Acima da Grid

source: Below Grid
pt: Embaixo da Grid

source: Location
pt: Localização

source: Show as Collapse
pt: Mostrar como Collapse

source: Enable Client-Side Search
pt: Habilitar Busca Client-Side

source: Show the filter in a Collapse Panel above the Grid. Filter behavior remains the same.
pt: Mostra o filtro em um Collapse Panel acima da Grid. O comportamento do Filtro permanece o mesmo.

source: Only data shown in the browser will be filtered.
pt: Apenas os dados mostrados no navegador serão filtrados.

source: View Action
pt: Ação de Visualizar

source: Import Action
pt: Ação de Importação

source: Export Action
pt: Ação de Exportação

source: Show Upload Outside Modal
pt: Mostrar Upload Fora do Modal

source: [Name] field cannot start with a number
pt: Campo [Nome] não pode começar com número

source: Real - Used for both GET and SET.&lt;/br&gt;Virtual - NOT used in any operation.&lt;br&gt;ReadOnly - Used only in GET.&lt;br&gt;WriteOnly - Used only in SET.
pt: Real - Usado em ambas operações de GET e SET.</br>Virtual - NÃO usado em nenhuma operação.<br>ReadOnly - Usado apenas para GET.<br>WriteOnly - Usado apenas para SET.

source: Caption
pt: Legenda

source: Help Text
pt: Texto de Ajuda

source: Help text that will be shown to the user.
pt: Text de ajuda que será mostrado para o usuário.

source: Submit On Save
pt: Realizar Submit Ao Salvar

source: Save Action
pt: Ação de Salvar

source: This week
pt: Esta semana

source: Audit Log
pt: Log de Auditoria

source: View Audit Log
pt: Visualizar Log De Auditoria

source: Edit Action
pt: Ação de Edição

source: Category
pt: Categoria

source: Created
pt: Criado

source: Level
pt: Nível

source: None
pt: Nenhum

source: Critical
pt: Crítico

source: {0} Selected Files
pt: {0} Arquivos Selecionados

source: Name of the file that will be downloaded by the user.
pt: Nome do arquivo que será baixado pelo usuário.

source: First Option
pt: Primeira Opção

source: Choose
pt: Escolha

source: [{0}]: Valued boolean expression cannot contain boolean operators.
pt: [{0}]: Expressão booleana de valor não pode conter operadores booleanos.

source: Field Map
pt: Mapa dos Campos

source: Plugin Configuration
pt: Configuração do Plugin

source: Success Message
pt: Mensagem de Sucesso

source: It will be shown when the form is reopened or the form is next to the grid.
pt: Será mostrada quando o form for reaberto ou o formulário estar com a grid.

source: Edit Relation
pt: Editar Relação

source: Add Relationship
pt: Adicionar Relacionamento

source: Is Submit
pt: É Submit

source: The script will be executed when the user clicks out of the component.
pt: O script será executado quando o usuário clicar fora do componente.

source: No fields selected for this panel.
pt: Nenhum campo selecionado para este painel.

source: Error while ordering fields.
pt: Erro ao ordenar campos.

source: Plugin Key
pt: Chave do Plugin

source: Checkbox components can only be of type Int or Boolean
pt: Componentes do tipo Checkbox só podem ser do tipo Int ou Booleano

source: Enable Pagination
pt: Habilitar Paginação

source: Maximum possible records
pt: Máximo de registros possíveis

source: Localization
pt: Internacionalização

source: Connection successfully estabilished.
pt: Conexão estabelecida com sucesso.

source: Error while testing the connection.
pt: Erro testando a conexão.

source: Other Options
pt: Outras Opções

source: Enable Audit Log
pt: Habilitar Log De Auditoria

source: AuditLog is disabled at Options.
pt: O Log de Auditoria está desabilitado nas Opções.

source: Audit Log is disabled. Please contact the administrator.
pt: Log de Auditoria desabilitado. Por favor contate o administrador.

source: Connection String
pt: String de Conexão

source: Field Name
pt: Nome do Campo

source: Trigger On Change
pt: Gatilhar quando alterar

source: Invalid character.
pt: Caractere inválido.

source: Data Item SQL Query
pt: Consulta SQL do Data Item

source: The query result must contain these columns in the following order:
pt: O resultado da consulta deve conter estas colunas na seguinte ordem:

source: Group (optional)
pt: Grupo (opcional)

source: Icon Id
pt: Id do ícone

source: {SearchId}: Id of the column used at the grid for recovering the description.
pt: {SearchId}: Id da coluna usado na grid para recuperar a descrição.

source: {SearchText}: Text entered by the user that can be used in the query.
pt: {SearchText}: Texto digitado pelo usuário que pode ser usado na query.

source: Group
pt: Grupo

source: Icon Color
pt: Cor do Ícone

source: Icon Color in Hexadecimal
pt: Cor do Ícone em Hexadecimal

source: {SearchId} is required at queries not using Id as Grid Behavior.
pt: {SearchId} é obrigatório em queries que não usam o Id como Comportamento na Grid.

source: Check &lt;a href=&quot;{0}&quot;&gt;the docs&lt;/a&gt; for more information.
pt: Veja <a href=\"{0}\">nossa documentação</a> para mais informações.

source: File successfully renamed.
pt: Arquivo renomeado com sucesso.

source: File successfully deleted.
pt: Arquivo deletado com sucesso.

source: This field support runtime values between curly bracets.
pt: Este campo suporta valores do runtime entre chaves.

source: Table or View Name
pt: Nome da Tabela ou View

source: Add Element
pt: Adicionar Elemento

source: Duplicate Element
pt: Duplicar Elemento

source: Original Element Name
pt: Nome do Elemento Original

source: New Element Name
pt: Nome do Novo Elemento

source: Encode HTML
pt: Codificar HTML

source: Option used to prevent XSS attacks. Uncheck this option if you really trust the origin of your data.
pt: Opção usada para prevenir ataques XSS. Desmarque essa opção somente se você realmente confia na origem de seus dados.

source: Use Floating Labels
pt: Usar Labels Flutuantes

source: Additional Info
pt: Informações Adicionais

source: Field size must be between 0 and 7 for DateTime2
pt: Tamanho do campo deve ser entre 0 e 7 para o tipo DateTime2

source: Error parsing value [{0}] for field [{1}].
pt: Erro parseando valor [{0}] para o campo [{1}].

source: Enable Element Actions
pt: Habilitar Ações do Elemento

source: (Do not apply)
pt: (Não aplicar)

source: Child Element
pt: Elemento Filho

source: Download all strings to create your own translation.
pt: Baixa todas as strings para criar sua própria tradução.

source: Download Resources
pt: Baixar Resources

source: Application Default
pt: Padrão da Aplicação

source: Show a label floating within the field. Not all fields support this option.
pt: Mostra uma label flutuando dentro do campo. Nem todos os campos suportam esta opção.

source: Rendering Template
pt: Template de Renderização

source: Edit Element
pt: Editar Elemento

source: Data Source
pt: Fonte de Dados

source: HTML Template
pt: Template HTML

source: (Type Ctrl+Space to autocomplete)
pt: (Utilize Ctrl+Espaço para autocompletar)

source: Here we use a Liquid template to render the HTML. Use the DataSource property to access your tables and columns.
pt: Aqui usamos um template Liquid para renderizar o HTML. Use a propriedade DataSource para acessar suas tabelas e colunas.

source: Button
pt: Botão

source: Buttons
pt: Botões

source: Pagination Type
pt: Tipo de Paginação

source: Copy From...
pt: Copiar De...

source: Just now
pt: Agora mesmo

source: 1 minute ago
pt: Há 1 minuto

source: {0} minutes ago
pt: Há {0} minutos

source: 1 hour ago
pt: Há 1 hora

source: {0} hours ago
pt: Há {0} horas

source: 1 day ago
pt: Há 1 dia

source: {0} days ago
pt: Há {0} dias

source: {0} months and 1 day ago
pt: Há {0} meses e 1 dia

source: A month ago
pt: Há 1 mês

source: A month ago and {0} days ago
pt: Há 1 mês e {0} dias

source: A month and 1 day ago
pt: Há 1 mês e 1 dia

source: {0} months and {1} days ago
pt: Há {0} meses e {1} dias

source: 1 year ago
pt: Há 1 ano

source: {0} years ago
pt: Há {0} anos

source: Code Editor
pt: Editor de Código

source: Open in New Tab
pt: Abrir em uma Nova Aba

source: Do you want to recreate the read procedure? Any changes made to the procedure will be lost.
pt: Deseja recriar a procedure de leitura? Quaisquer modificações feitas na procedure serão perdidas.

source: Do you want to recreate the write procedure? Any changes made to the procedure will be lost.
pt: Deseja recriar a procedure de escrita? Quaisquer modificações feitas na procedure serão perdidas.

source: Do you want to recreate all procedures? Any changes made to the procedures will be lost.
pt: Deseja recriar todas as procedures? Quaisquer modificações feitas na procedure serão perdidas.

source: Test
pt: Teste

source: Capitalization
pt: Capitalização

source: Automatically normalizes the text on save by applying the selected format. Useful for case-sensitive integrations (e.g., Protheus).
pt: Padroniza automaticamente o texto ao salvar, aplicando o formato escolhido. Útil para integrações case-sensitive (ex.: Protheus).
